tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/gpio_regs.h
/**
 * @file
 * @brief   Registers, Bit Masks and Bit Positions for the GPIO Peripheral Module.
 */

/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2017-02-14 18:13:08 -0600 (Tue, 14 Feb 2017) $
 * $Revision: 26423 $
 *
*************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_GPIO_REGS_H_
#define _MXC_GPIO_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

///@cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
///@endcond

/* **** Definitions **** */

/**
 * @ingroup     gpio
 * @defgroup    gpio_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions for the GPIO Peripheral Module.
 * @{
 */

/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/

/**
 * Structure type to access the GPIO Registers
 */
typedef struct {
    __IO uint32_t rst_mode[16];                          /**< <b><tt>0x0000-0x003C</tt></b> GPIO_RST_MODE_P[0..15] Registers - Power-On Reset Output Drive Mode            */
    __IO uint32_t free[16];                              /**< <b><tt>0x0040-0x007C</tt></b> GPIO_FREE_P[0..15] Registers - Free for GPIO Operation Flags                                   */
    __IO uint32_t out_mode[16];                          /**< <b><tt>0x0080-0x00BC</tt></b> GPIO_OUT_MODE_P[0..15] Registers - Output Drive Mode                                               */
    __IO uint32_t out_val[16];                           /**< <b><tt>0x00C0-0x00FC</tt></b> GPIO_OUT_VAL_P[0..15] Registers - GPIO Output Value                                               */
    __IO uint32_t func_sel[16];                          /**< <b><tt>0x0100-0x013C</tt></b> GPIO_FUNC_SEL_P[0..15] Registers - GPIO Function Select                                            */
    __IO uint32_t in_mode[16];                           /**< <b><tt>0x0140-0x017C</tt></b> GPIO_IN_MODE_P[0..15] Registers - GPIO Input Monitoring Mode                                      */
    __IO uint32_t in_val[16];                            /**< <b><tt>0x0180-0x01BC</tt></b> GPIO_IN_VAL_P[0..15] Registers - GPIO Input Value                                                */
    __IO uint32_t int_mode[16];                          /**< <b><tt>0x01C0-0x01FC</tt></b> GPIO_INT_MODE_P[0..15] Registers - Interrupt Detection Mode                                        */
    __IO uint32_t intfl[16];                             /**< <b><tt>0x0200-0x023C</tt></b> GPIO_INTFL_P[0..15] Registers - Interrupt Flags                                                 */
    __IO uint32_t inten[16];                             /**< <b><tt>0x0240-0x027C</tt></b> GPIO_INTEN_P[0..15] Registers - Interrupt Enables                                               */
} mxc_gpio_regs_t;
/**@} end of gpio_registers group */

/*
   Register offsets for module GPIO.
*/
/**
 * @ingroup gpio_registers
 * @defgroup GPIO_Register_Offsets Register Offsets
 * @brief GPIO Register Offsets from the GPIO Base Address.
 * @{
 */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_rst_mode_offsets Registers GPIO_RST_MODE_P[0..15] Offsets
 * @brief   GPIO_RST_MODE_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */
#define MXC_R_GPIO_OFFS_RST_MODE_P0                         ((uint32_t)0x00000000UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0000</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P1                         ((uint32_t)0x00000004UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0004</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P2                         ((uint32_t)0x00000008UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0008</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P3                         ((uint32_t)0x0000000CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x000C</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P4                         ((uint32_t)0x00000010UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0010</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P5                         ((uint32_t)0x00000014UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0014</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P6                         ((uint32_t)0x00000018UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0018</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P7                         ((uint32_t)0x0000001CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x001C</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P8                         ((uint32_t)0x00000020UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0020</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P9                         ((uint32_t)0x00000024UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0024</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P10                        ((uint32_t)0x00000028UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0028</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P11                        ((uint32_t)0x0000002CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x002C</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P12                        ((uint32_t)0x00000030UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0030</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P13                        ((uint32_t)0x00000034UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0034</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P14                        ((uint32_t)0x00000038UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0038</tt></b>    */
#define MXC_R_GPIO_OFFS_RST_MODE_P15                        ((uint32_t)0x0000003CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x003C</tt></b>    */
/**@} end of gpio_rst_mode group */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_free_offsets Registers GPIO_FREE_P[0..15] Offsets 
 * @brief    GPIO_FREE_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */    
#define MXC_R_GPIO_OFFS_FREE_P0                             ((uint32_t)0x00000040UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0040</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P1                             ((uint32_t)0x00000044UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0044</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P2                             ((uint32_t)0x00000048UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0048</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P3                             ((uint32_t)0x0000004CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x004C</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P4                             ((uint32_t)0x00000050UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0050</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P5                             ((uint32_t)0x00000054UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0054</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P6                             ((uint32_t)0x00000058UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0058</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P7                             ((uint32_t)0x0000005CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x005C</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P8                             ((uint32_t)0x00000060UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0060</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P9                             ((uint32_t)0x00000064UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0064</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P10                            ((uint32_t)0x00000068UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0068</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P11                            ((uint32_t)0x0000006CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x006C</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P12                            ((uint32_t)0x00000070UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0070</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P13                            ((uint32_t)0x00000074UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0074</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P14                            ((uint32_t)0x00000078UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0078</tt></b> */
#define MXC_R_GPIO_OFFS_FREE_P15                            ((uint32_t)0x0000007CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x007C</tt></b> */
/**@} end of gpio_free group */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_out_mode_offsets GPIO_OUT_MODE_P[0..15] Registers 
 * @brief    GPIO_OUT_MODE_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */   
#define MXC_R_GPIO_OFFS_OUT_MODE_P0                         ((uint32_t)0x00000080UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0080</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P1                         ((uint32_t)0x00000084UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0084</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P2                         ((uint32_t)0x00000088UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0088</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P3                         ((uint32_t)0x0000008CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x008C</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P4                         ((uint32_t)0x00000090UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0090</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P5                         ((uint32_t)0x00000094UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0094</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P6                         ((uint32_t)0x00000098UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0098</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P7                         ((uint32_t)0x0000009CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x009C</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P8                         ((uint32_t)0x000000A0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00A0</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P9                         ((uint32_t)0x000000A4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00A4</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_MODE_P10                        ((uint32_t)0x000000A8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00A8</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_MODE_P11                        ((uint32_t)0x000000ACUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00AC</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_MODE_P12                        ((uint32_t)0x000000B0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00B0</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_MODE_P13                        ((uint32_t)0x000000B4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00B4</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_MODE_P14                        ((uint32_t)0x000000B8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00B8</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_MODE_P15                        ((uint32_t)0x000000BCUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00BC</tt></b>  */
/**@} end of gpio_out_mode group */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_out_val_offsets GPIO_OUT_VAL_P[0..15] Registers 
 * @brief    GPIO_OUT_VAL_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */   
#define MXC_R_GPIO_OFFS_OUT_VAL_P0                          ((uint32_t)0x000000C0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00C0</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P1                          ((uint32_t)0x000000C4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00C4</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P2                          ((uint32_t)0x000000C8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00C8</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P3                          ((uint32_t)0x000000CCUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00CC</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P4                          ((uint32_t)0x000000D0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00D0</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P5                          ((uint32_t)0x000000D4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00D4</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P6                          ((uint32_t)0x000000D8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00D8</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P7                          ((uint32_t)0x000000DCUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00DC</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P8                          ((uint32_t)0x000000E0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00E0</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P9                          ((uint32_t)0x000000E4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00E4</tt></b> */
#define MXC_R_GPIO_OFFS_OUT_VAL_P10                         ((uint32_t)0x000000E8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00E8</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_VAL_P11                         ((uint32_t)0x000000ECUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00EC</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_VAL_P12                         ((uint32_t)0x000000F0UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00F0</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_VAL_P13                         ((uint32_t)0x000000F4UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00F4</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_VAL_P14                         ((uint32_t)0x000000F8UL)                        /**< Offset from GPIO Base Address: <b><tt>0x00F8</tt></b>  */
#define MXC_R_GPIO_OFFS_OUT_VAL_P15                         ((uint32_t)0x000000FCUL)                        /**< Offset from GPIO Base Address: <b><tt>0x00FC</tt></b>  */
/**@} end of gpio_out_val group */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_func_sel_offsets GPIO_FUNC_SEL_P[0..15] Registers 
 * @brief    GPIO_FUNC_SEL_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */   
#define MXC_R_GPIO_OFFS_FUNC_SEL_P0                         ((uint32_t)0x00000100UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0100</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P1                         ((uint32_t)0x00000104UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0104</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P2                         ((uint32_t)0x00000108UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0108</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P3                         ((uint32_t)0x0000010CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x010C</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P4                         ((uint32_t)0x00000110UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0110</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P5                         ((uint32_t)0x00000114UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0114</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P6                         ((uint32_t)0x00000118UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0118</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P7                         ((uint32_t)0x0000011CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x011C</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P8                         ((uint32_t)0x00000120UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0120</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P9                         ((uint32_t)0x00000124UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0124</tt></b> */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P10                        ((uint32_t)0x00000128UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0128</tt></b>  */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P11                        ((uint32_t)0x0000012CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x012C</tt></b>  */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P12                        ((uint32_t)0x00000130UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0130</tt></b>  */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P13                        ((uint32_t)0x00000134UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0134</tt></b>  */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P14                        ((uint32_t)0x00000138UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0138</tt></b>  */
#define MXC_R_GPIO_OFFS_FUNC_SEL_P15                        ((uint32_t)0x0000013CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x013C</tt></b>  */
/**@} end of gpio_func_sel */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_in_mode_offsets GPIO_IN_MODE_P[0..15] Registers 
 * @brief    GPIO_IN_MODE_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */ 
#define MXC_R_GPIO_OFFS_IN_MODE_P0                          ((uint32_t)0x00000140UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0140</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P1                          ((uint32_t)0x00000144UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0144</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P2                          ((uint32_t)0x00000148UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0148</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P3                          ((uint32_t)0x0000014CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x014C</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P4                          ((uint32_t)0x00000150UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0150</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P5                          ((uint32_t)0x00000154UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0154</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P6                          ((uint32_t)0x00000158UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0158</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P7                          ((uint32_t)0x0000015CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x015C</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P8                          ((uint32_t)0x00000160UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0160</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P9                          ((uint32_t)0x00000164UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0164</tt></b> */
#define MXC_R_GPIO_OFFS_IN_MODE_P10                         ((uint32_t)0x00000168UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0168</tt></b>  */
#define MXC_R_GPIO_OFFS_IN_MODE_P11                         ((uint32_t)0x0000016CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x016C</tt></b>  */
#define MXC_R_GPIO_OFFS_IN_MODE_P12                         ((uint32_t)0x00000170UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0170</tt></b>  */
#define MXC_R_GPIO_OFFS_IN_MODE_P13                         ((uint32_t)0x00000174UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0174</tt></b>  */
#define MXC_R_GPIO_OFFS_IN_MODE_P14                         ((uint32_t)0x00000178UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0178</tt></b>  */
#define MXC_R_GPIO_OFFS_IN_MODE_P15                         ((uint32_t)0x0000017CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x017C</tt></b>  */
/**@} end of gpio_in_mode group */
/**
 * @ingroup  GPIO_Register_Offsets
 * @defgroup gpio_in_val_offsets GPIO_IN_VAL_P[0..15] Registers 
 * @brief    GPIO_IN_VAL_P[0..15] Register Offsets from the GPIO Base Peripheral Address. 
 * @{
 */ 
#define MXC_R_GPIO_OFFS_IN_VAL_P0                           ((uint32_t)0x00000180UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0180</tt></b> */
#define MXC_R_GPIO_OFFS_IN_VAL_P1                           ((uint32_t)0x00000184UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0184</tt></b> */
#define MXC_R_GPIO_OFFS_IN_VAL_P2                           ((uint32_t)0x00000188UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0188</tt></b> */
#define MXC_R_GPIO_OFFS_IN_VAL_P3                           ((uint32_t)0x0000018CUL)                        /**< Offset from GPIO Base Address: <b><tt>0x018C</tt></b> */
#define MXC_R_GPIO_OFFS_IN_VAL_P4                           ((uint32_t)0x00000190UL)                        /**< Offset from GPIO Base Address: <b><tt>0x0190</tt></b> */
